const productsData = [
    {
        id: 1,
        title:
            "Белая Атмосфера: Современные Дома в Белом Стиле",
        description1: "Привнесите свет и гармонию в свою жизнь с нашим уникальным домом в светлом стиле. Мы создали этот просторный и современный дом, сочетающий элегантность с функциональностью. Большие окна позволяют свету заполнять каждый уголок, создавая уютную и теплую атмосферу. Внутренний дизайн вдохновлен модными интерьерами, что придает этому дому неповторимый шарм. Наслаждайтесь комфортом и роскошью в просторной гостиной, идеальной для семейных вечеров и приемов гостей. Наш дом - это мечта о современном жизненном стиле, где красота и функциональность идеально сочетаются.",
        description2: "Окунитесь в мир стильного интерьера с нашим модным домом, созданным с любовью к деталям. Светлые оттенки и изысканные элементы декора делают этот дом уникальным и неповторимым. Просторные и уютные комнаты позволяют вам реализовать свои творческие идеи и создать интерьер вашей мечты. Открытая планировка придает ощущение пространства и свободы, позволяя вам наслаждаться каждым моментом вашей жизни. Роскошная кухня с современными технологиями станет сердцем вашего дома, где собирается вся семья. Дополните свой интерьер изысканными аксессуарами и сделайте этот дом вашим уникальным убежищем стиля и комфорта.",
        largeImage: "img/products/product1[1].jpg",
        smallImages: [
            "img/products/product1.png",
            "img/products/product1[2].jpg",
            "img/products/product1[3].jpg"
        ]
    },
    {
        id: 2,
        title: "Hi-Tech Domus: Будущее сегодняшнего дня",
        description1: "Добро пожаловать в мир инноваций и комфорта с нашим hi-tech домом. Этот современный дом создан с применением последних технологий, чтобы удовлетворить все ваши потребности. Умный домовладение позволяет контролировать все аспекты вашего дома из одного устройства – от освещения и климат-контроля до системы безопасности. Благодаря автоматизации и искусственному интеллекту, ваш дом будет предугадывать ваши желания и адаптироваться под ваш образ жизни. Просторные и светлые помещения создают ощущение пространства и свободы, а современный дизайн придаст вашему дому стильный вид. Наслаждайтесь максимальным комфортом и уютом в этом hi-tech доме будущего.",
        description2: "Шаг впереди своего времени – наш hi-tech дом, где технологии встречаются с элегантным дизайном. Этот дом – олицетворение современности и функциональности. Уникальные инновационные решения упростят вашу жизнь и сделают ее более комфортной. Голосовое управление и датчики движения позволят управлять вашим домом без усилий, создавая атмосферу с учетом всех ваших предпочтений. Стильный дизайн, сочетающий стекло, металл и современные материалы, придаст вашему дому современный вид. Здесь вы сможете реализовать свои самые смелые идеи и наслаждаться комфортом и функциональностью каждый день. Воплотите мечту о будущем уже сегодня в нашем hi-tech доме.",
        largeImage: "img/products/product2[1].jpg",
        smallImages: [
            "img/products/product2.png",
            "img/products/product2[2].jpg",
            "img/products/product2[3].jpg"
        ]
    },
    {
        id: 3,
        title: "Современные Здания: Гармония Инноваций и Эстетики",
        description1: "Откройте для себя захватывающий мир современной архитектуры, где инновационные решения и эстетическая красота переплетаются в совершенную гармонию. Современные здания – это олицетворение смелых идей и передовых технологий. Большие стеклянные фасады придают зданиям легкость и прозрачность, позволяя свету заполнять каждый уголок. Архитектурные формы смешиваются с природным окружением, создавая единое целое с окружающим ландшафтом. Внутренние пространства удивляют функциональностью и комфортом, а умные технологии позволяют управлять всеми аспектами жизни в здании. Современные здания не только впечатляют своей архитектурой, но и служат примером будущего, где функциональность и стиль гармонично переплетаются.",
        description2: "Современные здания – это мир творчества и возможностей. Это места, где архитектура превращается в искусство. Уникальные формы и нестандартные решения делают каждое здание уникальным произведением. Материалы будущего, такие как стекло, металл и бетон, используются для создания легких и воздушных конструкций. Внутренние пространства впечатляют своим минимализмом и функциональностью, а многоуровневые атриумы и крытые сады придают зданиям особую атмосферу. Современные здания представляют собой гармонию между человеком и окружающим миром, где архитектура служит не только для удовлетворения потребностей, но и для воплощения самых смелых мечтаний.",
        largeImage: "https://s0.rbk.ru/v6_top_pics/resized/1005xH/media/img/5/45/755506845392455.jpeg",
        smallImages: [
            "img/products/product3.png",
            "img/products/product3[2].jpg",
            "img/products/product3[3].jpg"
        ]
    },
    {
        id: 4,
        title: "Центр Развлечений: Отдыхай с Удовольствием",
        description1: "Добро пожаловать в захватывающий мир развлечений и удовольствий! Наш Досуговый Центр предлагает вам незабываемый отдых для всей семьи. Здесь вы найдете богатый выбор развлечений для всех возрастов: от захватывающих аттракционов и адреналиновых экстрим-игр до уютных кинотеатров и игровых комнат. Наша команда опытных аниматоров заботится о том, чтобы каждый гость чувствовал себя особенным. Для любителей активного отдыха у нас есть спортивные площадки, бассейн и фитнес-залы. Для ценителей культуры – мастер-классы, концерты и выставки. А для гурманов – рестораны и кафе с изысканными блюдами. Забудьте о повседневных заботах и окунитесь в атмосферу радости и веселья в нашем Досуговом Центре. Здесь каждый найдет что-то по своему вкусу и проведет незабываемое время с удовольствием.",
        description2: "Наш Досуговый Центр – это место, где воплощаются самые свежие идеи о современном отдыхе. Мы создали уникальное пространство, где собраны самые интересные и разнообразные развлечения. Наш центр олицетворяет собой гармонию между комфортом и адреналином. Здесь вы можете попробовать себя в роли путешественника, воина, детектива или просто насладиться красотами виртуальных миров. Для любителей релакса у нас есть уютные зоны для чтения и спокойных бесед. А для тех, кто жаждет новых ощущений, мы предлагаем уникальные аттракционы и игры. Наш Досуговый Центр – это место, где каждый день – это приключение, а каждый гость – герой своей истории. Приходите и окунитесь в мир веселья и радости с нами!",
        largeImage: "img/products/product4[1].webp",
        smallImages: [
            "img/products/product4[2].jpg",
            "img/products/product4[3].jpg",
            "img/products/product4[4].webp"
        ]
    },
    {
        id: 5,
        title: "Невероятные Сооружения: Архитектурные Чудеса Мира",
        description1: "Добро пожаловать в захватывающий мир невероятных сооружений, которые поражают своим великолепием и уникальностью. Эти архитектурные чудеса воплощают смелые идеи и творческий потенциал человечества. Грандиозные небоскребы, каскадные мосты, подводные отели, вращающиеся здания - каждое из этих сооружений - настоящее произведение искусства инженерии и дизайна. Они служат примером мастерства и умения человека преобразовывать окружающий мир. Путешествуя по нашему удивительному миру, вы сможете увидеть самые невероятные и удивительные сооружения, которые заставляют нас задуматься о возможностях человеческого гения.",
        description2: "Невероятные сооружения - это творения, которые выходят за рамки привычного и показывают нам, насколько велик и многогранен человеческий разум. Эти уникальные архитектурные формы олицетворяют собой смелость и стремление к прогрессу. Они не только впечатляют своими размерами, но и воплощают в себе новаторские технологии и идеи. Посетив эти чудеса архитектуры, вы окунетесь в мир сказочных возможностей и ощутите, как человеческий дух способен преобразить обыденность в величественное и удивительное. Невероятные сооружения – это воплощение мечты и стремления человека к гармонии с окружающим миром.",
        largeImage: "img/products/product5[1].jpg",
        smallImages: [
            "img/products/product5[2].jpeg",
            "img/products/product5[3].jpg",
            "img/products/product5[4].webp"
        ]
    },
    {
        id: 6,
        title: "Эволюция Страны: Развитие Архитектуры и Культурных Объектов",
        description1: "Путешествие сквозь время и пространство, в котором раскрывается удивительная история развития страны через архитектурные шедевры и культурные объекты. Эволюция страны отражается в ее архитектуре, которая сочетает традиции прошлого с современными инновациями. Грандиозные дворцы, исторические замки, церкви и соборы – каждое из этих зданий рассказывает свою уникальную историю о нации и ее наследии. Культурные объекты - музеи, театры, искусство и литература - также играют важную роль в формировании национальной идентичности и становлении культурного богатства. Они отражают творческий дух народа и способность обогащать общество через искусство и культуру. Развитие страны отражается в ее архитектурных и культурных объектах, которые воплощают " +
            "в себе дух времени и дарят нам возможность понять и ценить наше прошлое и настоящее.",
        description2: "Архитектура и культурные объекты – это зеркало развития страны. Они отражают динамичность и разнообразие ее истории и культуры. Здания и памятники, сооруженные в разные эпохи, свидетельствуют о ее прошлом и современности. Архитектурные стили меняются от эпохи к эпохе, а каждый из них приносит свой вклад в формирование облика страны. Культурные объекты, в свою очередь, сохраняют и распространяют национальное творчество и идентичность. Музеи хранят ценные артефакты, а театры и выставки обогащают нашу жизнь и расширяют кругозор. Эволюция страны олицетворяется в ее архитектурных шедеврах и культурных достижениях, которые становятся настоящими сокровищами нации.",
        largeImage: "img/products/product6[1].webp",
        smallImages: [
            "img/products/product6[2].webp",
            "img/products/product6[3].jpg",
            "img/products/product6[4].jpg"
        ]
    },
    {
        id: 7,
        title: "Проект Навострой: Новые Горизонты Комфортного Жилья",
        description1: "Проект Навострой - это инновационная концепция строительства, где комфорт становится главным приоритетом. Вдохновленные успешным проектом 'Комфорт Таун' в Киеве, мы создаем уникальные жилые комплексы, сочетающие в себе современные технологии, удобство и стиль. Наша команда опытных архитекторов и дизайнеров работает над каждым проектом, чтобы предложить индивидуальные решения для каждого клиента. Квартиры с функциональной планировкой и просторными окнами позволяют свету заполнять пространство, создавая уют и гармонию. Комплексы Навострой оборудованы современной инфраструктурой - спортзалами, детскими площадками, зонами отдыха и озелененными территориями. Мы стремимся создать идеальное место для вашей семьи, где каждый момент становится особенным и незабываемым.",
        description2: "Проект Навострой - это ответ на запросы современного общества о комфортном и качественном жилье. Мы принимаем во внимание все потребности и предпочтения наших клиентов, чтобы предложить оптимальное решение для каждого. Наши жилые комплексы - это не просто здания, это настоящие комфортные городки с разнообразной инфраструктурой и ухоженными территориями. Проекты Навострой стремятся обеспечить гармоничное сочетание современных технологий и природного окружения. У нас вы найдете квартиры с инновационными решениями, созданными с любовью к деталям. Мы приглашаем вас присоединиться к проекту Навострой и обрести свой уютный уголок в современном мире комфорта и качественного жилья.",
        largeImage: "img/products/product7[1].jpg",
        smallImages: [
            "img/products/product7[2].jpg",
            "img/products/product7[3].webp",
            "img/products/product7[4].jpg"
        ]
    },
    {
        id: 8,
        title: "Развлечение и Досуг Будущего: Киберспорт и Новые Горизонты Развлечений",
        description1: "Добро пожаловать в захватывающий мир развлечений будущего, где киберспорт становится одним из самых популярных и увлекательных видов досуга. Киберспорт - это синтез технологий и развлечений, где игроки сражаются в виртуальных мирах, соревнуясь на грандиозных международных турнирах. Это новая форма спорта, которая привлекает миллионы зрителей и поклонников со всего мира. Киберспорт объединяет различные культуры и национальности, создавая мощное сообщество единомышленников. В будущем, киберспорт станет еще более значимой частью нашей жизни, предоставляя новые возможности для развлечений и досуга. Помимо киберспорта, развлечения будущего будут полны инноваций - виртуальной реальности, голографических шоу, умных парков развлечений и многого другого. Готовьтесь к захватывающему путешествию в мир развлечений и досуга будущего!",
        description2: "В мире будущего, развлечения и досуг будут претерпевать революционные изменения, а киберспорт станет непременной частью этой трансформации. Киберспорт - это симбиоз высоких технологий и азарта, где игроки сражаются на виртуальных аренах и турнирах с помощью передовых игровых технологий. Это область, которая привлекает миллионы фанатов и зрителей, создавая целые электронные спортивные коммьюнити. В будущем, киберспорт станет еще более популярным и востребованным видом досуга, предоставляя возможности для профессиональной карьеры и развлечений для всех возрастов. Вместе с развитием виртуальной реальности и технологий искусственного интеллекта, развлечения будущего станут еще более захватывающими и непредсказуемыми. Представьте себе мир, где вы сможете стать участником захватывающих киберприключений, или окунуться в мир виртуальных миров - все это ждет нас в будущем развлечений и досуга!",
        largeImage: "img/products/product8[1].jpeg",
        smallImages: [
            "img/products/product8[2].png",
            "img/products/product8[3].jpg",
            "img/products/product8[4].jpeg"
        ]
    },
    {
        id: 9,
        title: "МоноБанк: Вдохновение и поддержка для малого бизнеса",
        description1: "Малый бизнес – это сердце экономики, и его развитие играет важную роль в процветании общества. Однако предпринимателям часто не хватает финансовых ресурсов и поддержки для реализации своих идей. В этом контексте появление МоноБанка стало настоящим прорывом. Этот инновационный банк предлагает уникальные решения для малого бизнеса, предоставляя гибкие кредиты, оптимизированные условия и персональное обслуживание.",
        description2: "МоноБанк – это пример того, как инновации и эмпатия могут изменить игру в мире малого бизнеса. Он предоставляет своим клиентам удобный мобильный банкинг, который позволяет контролировать финансы, принимать быстрые решения и развиваться с уверенностью. Команда банка учитывает потребности предпринимателей и создает продукты, ориентированные на реальные вызовы современного рынка.Кроме того, МоноБанк активно поддерживает социальные и культурные проекты, способствуя росту общества. Банк инициирует программы финансовой грамотности и стартап-акселераторы, помогая талантливым предпринимателям реализовать свои идеи. Такая поддержка не только способствует росту бизнеса, но и вносит значимый вклад в общественную жизнь. МоноБанк продолжает вдохновлять и поддерживать предпринимателей на пути к успеху и процветанию.",
        largeImage: "img/products/product9[1].jpeg",
        smallImages: [
            "img/products/product9[2].webp",
            "img/products/product9[3].jpeg",
            "img/products/product9[4].png"
        ]
    },
    {
        id: 10,
        title: "Доступное жилье: Перспективы для тех, кто потерял всё",
        description1: "События последних лет в Украине, связанные с войной и конфликтом, привели к трагической потере жилья для многих людей. Тысячи семей оказались вынуждены покинуть свои дома и начать все сначала. Но в этой сложной ситуации есть надежда и возможности для тех, кто мечтает о новом доме. Программы доступного жилья стали настоящим подспорьем для людей, столкнувшихся с жилищными проблемами.\n" +
            "\n" +
            "Государство и некоммерческие организации активно работают над созданием программ и инициатив, которые обеспечивают финансовую поддержку и предоставляют доступное жилье для тех, кто его потерял. Такие программы помогают снизить финансовый барьер и облегчить процесс покупки жилья. Более того, они содействуют социальной адаптации и интеграции в общество для тех, кто сталкивается с потерей дома из-за военных событий.",
        description2: "Доступное жилье стало символом надежды для тех, кто потерял все в результате военных действий. Эти программы предлагают различные варианты жилья, такие как субсидированная ипотека, аренда с выкупом или содействие в строительстве жилья. Они также предоставляют специальные условия для ветеранов и участников боевых действий, которые боролись за мир и стабильность страны.\n" +
            "\n" +
            "Доступное жилье не только дает возможность обрести крышу над головой, но и создает новые возможности для благополучного будущего. Оно позволяет многим семьям вернуть надежду и уверенность в завтрашнем дне. Программы доступного жилья стали мощным катализатором для восстановления и стабилизации жилищного рынка после военных потрясений. Они продолжают оказывать поддержку и помощь тем, кто стремится построить новый дом и начать новую жизнь, несмотря на сложности прошлого.",
        largeImage: "img/products/product10[1].jpg",
        smallImages: [
            "img/products/product10[2].jpg",
            "img/products/product10[3].jpg",
            "img/products/product10[4].jpg"
        ]
    },
    {
        id: 11,
        title: "Перспективы молодежи: Инновации и становление новых отраслей",
        description1: "Молодежь играет ключевую роль в развитии общества, и ее перспективы становятся все более обширными в эпоху быстрого технологического прогресса. Один из самых динамично развивающихся секторов - это IT. Молодые специалисты в области информационных технологий находятся на переднем крае инноваций, создавая новые продукты и услуги, которые трансформируют нашу жизнь и делают ее более удобной и эффективной. Благодаря доступности образования и возможностям удаленной работы, молодежь входит в мир IT с огромным потенциалом и энтузиазмом, что способствует его быстрому развитию.\n" +
            "\n" +
            "Также молодежь проявляет интерес к психологии, здоровью и благополучию. Растущее понимание важности психического здоровья приводит к росту спроса на психологов, консультантов и терапевтов. Молодые специалисты в этой области предлагают инновационные подходы к психологическому сопровождению, помогая людям преодолеть стресс, тревогу и другие проблемы, влияющие на их жизнь и работу. Эта область также оказывает сильное влияние на сферу образования, улучшая условия обучения и поддерживая учеников и студентов на пути к успеху.",
        description2: "Сельское хозяйство также предоставляет молодежи огромные перспективы. Агрономия - это сфера, которая в настоящее время переживает революцию благодаря инновациям и технологиям. Молодые специалисты активно внедряют цифровые решения в аграрный сектор, что повышает эффективность производства и улучшает условия труда для сельских жителей. Благодаря применению современных методов и новых технологий в сельском хозяйстве, удается обеспечивать продовольственную безопасность страны и поддерживать устойчивое развитие в сельских районах.\n" +
            "\n" +
            "Однако, чтобы реализовать свой потенциал и достичь успеха в выбранных сферах, молодежи необходимо активное содействие и поддержка со стороны государства и бизнес-сообщества. Создание специальных программ, стипендий и менторских программ поможет молодым людям воплотить свои идеи в жизнь и реализовать свой потенциал на благо общества и страны в целом. Молодежь - это движущая сила прогресса, и поддержка ее инициатив и развития является ключевым фактором в обеспечении процветания и устойчивого развития нашей страны.",
        largeImage: "img/products/product11[1].jpg",
        smallImages: [
            "img/products/product11[2].jpg",
            "img/products/product11[3].jpg",
            "img/products/product11[4].jpg"
        ]
    },
];


const urlParams = new URLSearchParams(window.location.search);
const productId = urlParams.get("id");

const selectedProduct = productsData.find((product) => product.id === parseInt(productId));

if (selectedProduct) {
    document.querySelector(".product-image").src = selectedProduct.largeImage;
    document.querySelector(".product-title").textContent = selectedProduct.title;
    document.querySelector(".product-description1").textContent = selectedProduct.description1;
    document.querySelector(".product-description2").textContent = selectedProduct.description2;

    const smallImages = document.querySelectorAll(".small-image");
    smallImages.forEach((image, index) => {
        image.src = selectedProduct.smallImages[index];
    });
} else {
    // Якщо товар не знайдено, можна вивести повідомлення про помилку або перенаправити на іншу сторінку
    window.location.href = "error.html";
}